app/controllers/categories_controller.rb

INSERT INTO "categories" ("tittle", "created_at", "updated_at") VALUES (?, ?, ?)  [["tittle", "tieng nhat"], ["created_at", 2016-11-22 09:11:39 UTC], ["updated_at", 2016-11-22 09:11:39 UTC]]
---
  def create
    @category = Category.new(category_params)
    if @category.save

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "lessons".* FROM "lessons" WHERE "lessons"."category_id" = ? LIMIT ? OFFSET ?  [["category_id", 1], ["LIMIT", 30], ["OFFSET", 0]]
---
  def show
    @category = Category.find(params[:id])
    @lessons = @category.lessons.paginate(page: params[:page])

SELECT  "categories".* FROM "categories" LIMIT ? OFFSET ?  [["LIMIT", 30], ["OFFSET", 0]]
---
  def index
  @categories = Category.paginate(page: params[:page])

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "categories" WHERE "categories"."id" = ?  [["id", 3]]
---
  def destroy
    @category = Category.find(params[:id])
    if @category.present?
      @category.destroy

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "categories" SET "tittle" = ?, "updated_at" = ? WHERE "categories"."id" = ?  [["tittle", "Tieng Anh 2"], ["updated_at", 2016-11-22 10:38:43 UTC], ["id", 1]]
---
  def update
    @category = Category.find(params[:id])
    if @category.update_attributes(category_params)