app/controllers/lessons_controller.rb

SELECT  "lessons".* FROM "lessons" WHERE "lessons"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @lesson = Lesson.find(params[:id])

INSERT INTO "lessons" ("tittle", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["tittle", "asd"], ["category_id", 1], ["created_at", 2016-11-22 10:14:35 UTC], ["updated_at", 2016-11-22 10:14:35 UTC]]
---
  def create
    @lesson = Lesson.new(lesson_params)
    @lesson.category_id = params[:category_id]
    if @lesson.save

SELECT  "lessons".* FROM "lessons" WHERE "lessons"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "lessons" WHERE "lessons"."id" = ?  [["id", 3]]
---
  def destroy
    @lesson = Lesson.find(params[:id])
    if @lesson.present?
      @lesson.destroy

SELECT  "lessons".* FROM "lessons" WHERE "lessons"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @lesson = Lesson.find(params[:id])

SELECT  "lessons".* FROM "lessons" WHERE "lessons"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "lessons" SET "tittle" = ?, "updated_at" = ? WHERE "lessons"."id" = ?  [["tittle", "Tieng Nga co ban 1"], ["updated_at", 2016-11-23 08:20:02 UTC], ["id", 1]]
---
  def update
    @lesson = Lesson.find(params[:id])
    if @lesson.update_attributes(lesson_params)