app/controllers/user_lessons_controller.rb

  def create
    @userlesson = UserLesson.new(userlesson_params)
    @userlesson.user_id = current_user.id
    @userlesson.lesson_id = params[:lesson_id]
    if @userlesson.save
---
INSERT INTO "user_lessons" ("user_id", "lesson_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["lesson_id", 2], ["created_at", 2016-11-23 13:25:14 UTC], ["updated_at", 2016-11-23 13:25:14 UTC]]