app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "email" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "nhantt"], ["email", "nhantt@gmail.com"], ["password_digest", "$2a$10$tTZY.qkQPRy8HLPmiq2ttOITJ3/qY6AH52P4/QEUqnFmV2t.hEc/u"], ["updated_at", 2016-11-21 03:13:50 UTC], ["id", 3]]
---
   def update
    @user = User.find(params[:id])
    if @user.update_attributes(user_params)